NextFOAM-2506/tutorials/incompressible/pimpleFoam/RAS/axialTurbine_rotating_oneBlade/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.6283; //One rotation
//endTime         1.2566; //Two rotations

deltaT          0.00175;//Approx 1 degree per time step

writeControl    timeStep;

writeInterval   10;//Every 10 degrees

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

DebugSwitches
{
    //cyclicPeriodicAMI 5;
    //cyclicAMI 5;
    //cyclic 5;
}

// ************************************************************************* //
