NextFOAM-2506/tutorials/incompressible/pimpleFoam/RAS/axialTurbine_rotating_oneBlade/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    GVINLET
    {
        type            zeroGradient;
        value           $internalField;
    }

    DTOUTLET
    {
        type            fixedValue;
        value           $internalField;
    }

    "(.*HUB|RUBLADE.*|GVBLADE.*|.*SHROUD)"
    {
        type            zeroGradient;
        value           $internalField;
    }

    "(GVOUTLET|RUINLET|RUOUTLET|DTINLET)"
    {
        type            cyclicAMI;
        value           $internalField;
    }
/*
    "(.*CYCLIC.*)"
    {
        type            cyclicAMI;
        value           $internalField;
    }
*/
}


// ************************************************************************* //
